# 第5章_pandas_入门

In [19]:
from pandas import Series, DataFrame
import pandas as pd

## pandas 的数据结构介绍

## Series

In [20]:
obj = Series([4, 7, -5, 3])

In [21]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [22]:
obj.values

array([ 4,  7, -5,  3])

In [23]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [25]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [26]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [27]:
obj2['a']

-5

In [28]:
obj2[2]

-5

In [29]:
obj2['d'] = 6

In [30]:
obj2['d']

6

In [31]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [32]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [33]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [34]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [35]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [36]:
import numpy as np

In [37]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [38]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [39]:
'b' in obj2

True

In [40]:
'e' in obj2

False

In [41]:
6 in obj2

False

In [42]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregen': 16000, 'Utah': 5000}

In [45]:
obj3 = Series(sdata)

In [46]:
obj3

Ohio      35000
Oregen    16000
Texas     71000
Utah       5000
dtype: int64

In [47]:
states = ['California', 'Ohio', 'Oregen', 'Texas']

In [48]:
obj4 = Series(sdata, index=states)

In [49]:
obj4

California        NaN
Ohio          35000.0
Oregen        16000.0
Texas         71000.0
dtype: float64

In [50]:
pd.isnull(obj4)

California     True
Ohio          False
Oregen        False
Texas         False
dtype: bool

In [51]:
pd.notnull(obj4)

California    False
Ohio           True
Oregen         True
Texas          True
dtype: bool

In [52]:
obj4.isnull()

California     True
Ohio          False
Oregen        False
Texas         False
dtype: bool

In [53]:
obj4.notnull()

California    False
Ohio           True
Oregen         True
Texas          True
dtype: bool

In [54]:
obj3

Ohio      35000
Oregen    16000
Texas     71000
Utah       5000
dtype: int64

In [55]:
obj4

California        NaN
Ohio          35000.0
Oregen        16000.0
Texas         71000.0
dtype: float64

In [56]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregen         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [57]:
obj4.index

Index(['California', 'Ohio', 'Oregen', 'Texas'], dtype='object')

In [59]:
obj4.values

array([    nan,  35000.,  16000.,  71000.])

In [61]:
obj4.name = 'population'

In [62]:
obj4.name

'population'

In [63]:
obj4.index.name = 'state'

In [64]:
obj4.index.name

'state'

In [65]:
obj4

state
California        NaN
Ohio          35000.0
Oregen        16000.0
Texas         71000.0
Name: population, dtype: float64

In [66]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [67]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [68]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [70]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [71]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [72]:
frame = DataFrame(data)

In [73]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [74]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [76]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])

In [77]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [78]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [79]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [80]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [82]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [83]:
frame2['debt'] = 16.5

In [84]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [86]:
frame2.debt = np.arange(5)

In [87]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [88]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [89]:
frame2['debt'] = val

In [90]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [91]:
frame2['eastern'] = (frame2.state == 'Ohio')

In [92]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [94]:
del frame2['eastern']

In [95]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [96]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [101]:
# 外层字典的键作为列，内层键作为行索引
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [102]:
frame3 = DataFrame(pop)

In [103]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [104]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [105]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [106]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [108]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [109]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [110]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [111]:
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [112]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [113]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [114]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [115]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

###  索引对象

In [116]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [117]:
obj

a    0
b    1
c    2
dtype: int64

In [118]:
index = obj.index

In [119]:
index

Index(['a', 'b', 'c'], dtype='object')

In [120]:
index[1:]

Index(['b', 'c'], dtype='object')

In [121]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [123]:
index = pd.Index(np.arange(3))

In [124]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [125]:
obj2.index is index

True

In [126]:
obj

a    0
b    1
c    2
dtype: int64

In [127]:
obj.index[0]

'a'

In [128]:
obj.index[0] = 'd'

TypeError: Index does not support mutable operations

In [129]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [130]:
'Ohio' in frame3.columns

True

In [131]:
'Ohio' in frame3

True

In [132]:
2003 in frame3.index

False

## 基本功能
### 重新索引

In [133]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [135]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [136]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [137]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [138]:
obj_test = obj.reindex()

In [139]:
obj_test

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [140]:
obj_test = obj.reindex([])

In [141]:
obj_test

Series([], dtype: float64)

In [142]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [143]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [146]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [145]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object